# Повторяющиеся элементы
#
# Напишите программу, которая находит индексы элементов кортежа, 
# встречающихся более одного раза. Вывести сами элементы и их индексы.
#
# Данные:
#
# numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)
#
#
# Пример вывода:
#
# Индексы элемента 2: 1 4 9 
#
# Индексы элемента 3: 2 6 
#
# Индексы элемента 4: 3 8

numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)

index = {}

for i, element in enumerate(numbers):
    index[element] = index.get(element, []) + [i]

for key, value in index.items():
    if len(value) > 1:
        print("Индексы элемента", key, ":", *value)
