""" 02 Зеркальное подмножество

Напишите программу, которая
- проверяет, являются ли элементы одного из множеств подмножеством другого.

В случае положительного ответа возвращает разницу между двумя множествами.

Проверить необходимо в обе стороны.

Данные:
set1 = {2, 3, 4, 5, 6}
set2 = {4, 5}

Пример вывода:
Подмножество: True
Разница: {2, 3, 6}
=====================
Данные:
set1 = {2, 3, 4, 5, 6}
set2 = {4, 7}

Пример вывода:
Подмножество: False
"""

def is_subset(set1, set2):
    return set2.issubset(set1)


def difference(set1, set2):
    return set1.difference(set2)



test_cases = [
    ({2, 3, 4, 5, 6}, {4, 5}),
    ({2, 3, 4, 5, 6}, {4, 7}),
]

for set1, set2 in test_cases:
    print("\n=====================\n")
    print("Данные:")
    print("set1: ", set1)
    print("set2: ", set2)
    print()
    print("Подмножество: ", set2.issubset(set1))
    print("Разница: ", set1.difference(set2))
